observer2/README.md
```mermaid

classDiagram
  class ChatRoom
  class ChatUser
  class ChatRoomNotifier
  interface Notifier
  interface Observer

  ChatUser --|> Observer
  Observer <-- ChatRoomNotifier

  ChatRoom --> Notifier
  Notifier <|-- ChatRoomNotifier

```
